[
    {
        "title": "#1 CONECTA 4",
        "code": [
            "/*",
            " * Crea el juego conecta cuatro.",
            " *",
            " * Requisitos:",
            " * - Tablero de 7x6 (7 en el eje \"x\" y 6 en el \"y\").",
            " * - Fichas Rojas y Amarillas. La primera partida la comienza siempre la Roja",
            " *   (la segunda la Amarilla, la tercera la Roja...).",
            " * - No hay que implementar una funcionalidad que te permita jugar contra la App.",
            " *   Se asume que jugar치n dos personas reales altern치ndose.",
            " * - Al seleccionar la columna se coloca la ficha en la parte inferior.",
            " * - Guardar el n칰mero partidas ganadas de cada equipo mientras la App no se finaliza.",
            " * - Dos botones para reiniciar la partida en marcha y para resetear el",
            " *   contador de victorias y derrotas.",
            " * - Puedes a침adirle todas las funcionalidades extra que consideres.",
            " */"
        ],
        "url": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto01.md"
    },
    {
        "title": "#2 LA ENCICLOPEDIA STAR WARS",
        "code": [
            "/*",
            " * Crea una app que sirva para listar los personajes de Star Wars y que te permita",
            " * buscarlos por nombre.",
            " *",
            " * Requisitos:",
            " * - Usa el API https://swapi.dev",
            " * - El dise침o es de libre elecci칩n.",
            " * - Debe mostrar un listado y un detalle de cada personaje.",
            " * - El listado tendr치 que estar paginado.",
            " * - El listado poseer치 un filtro de b칰squeda.",
            " * - Al seleccionar un personaje del listado, el detalle mostrar치 los datos que",
            " *   consideres oportunos.",
            " * - OPCIONAL: Detalle de pel칤culas, veh칤culos, naves, especies...",
            " * - OPCIONAL: Foto de cada personaje.",
            " */"
        ],
        "url": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto02.md"
    },
    {
        "title": "#3 CUESTIONARIO CONTRARRELOJ",
        "code": [
            "/*",
            " * Crea una \"Quiz app\" contrareloj con ranking.",
            " *",
            " * Requisitos:",
            " * - El dise침o es de libre elecci칩n.",
            " * - La tem치tica de las preguntas del cuestionario ser치 de libre elecci칩n. Puede estar",
            " *   bien seguir un mismo tema (por ejemplo, preguntas sobre el universo \"Harry Potter\").",
            " * - En la pantalla inicial podr치s comenzar a jugar o consultar el ranking de puntuaciones.",
            " * - El juego consistir치 en 10 preguntas aleatorias con 3 respuestas y s칩lo una correcta.",
            " *   Recomendable crear m치s de 10 preguntas para que no siempre salgan las mismas. Cada vez",
            " *   que se responde a una pregunta, se pasar치 a la siguiente.",
            " * - Disponemos de 30 segundos para responder cada pregunta. El contador deber치 aparecer",
            " *   en la pantalla, y si llega a 0 se tomar치 como respuesta incorrecta y se pasar치",
            " *   a la siguiente pregunta.",
            " * - Al marcar una respuesta o finalizar el tiempo, se mostrar치 si se ha acertado o no la",
            " *   pregunta, dando feedback sobre cu치l ser칤a la respuesta correcta y navegando al cabo",
            " *   de un par de segundos a la siguiente pantalla.",
            " * - Sistema de puntuaci칩n:",
            " *   - Contador a 0 o respuesta incorrecta = 0 puntos.",
            " *   - Contador mayor 0 y respuesta correcta = [segundos restantes] puntos.",
            " *     Ej: Si quedaban 9 segundos para finalizar la cuenta atr치s y se acierta la pregunta,",
            " *  se asignan 9 puntos.",
            " * - Una vez finalizada la pregunta n칰mero 10 se mostrar치 en una nueva pantalla",
            " *   la puntuaci칩n final y se deber치 introducir un nombre para guardarla de forma",
            " *   persistente (aunque cerremos la app). Hecho estos se mostrar치 la pantalla de ranking.",
            " * - La pantalla de ranking muestra ordenados de mayor a menor los 10 mejores",
            " *   resultados y el nombre guardado. Desde esta pantalla siempre se podr치 navegar",
            " *   a la pantalla inicial.",
            " */"
        ],
        "url": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto03.md"
    },
    {
        "title": "#4 POMODORO",
        "code": [
            "/*",
            " *Crea un \"Pomodoro\" configurable que guarde todo tu historial de tareas.",
            " *",
            " * La t칠cnica \"pomodoro\" es un m칠todo para mejorar la administraci칩n del tiempo dedicado",
            " * a una actividad e incrementar tu productividad.",
            " *",
            " * Requisitos:",
            " * - Poseer치 un campo de texto para introducir el nombre de la tarea que se est치 llevando a cabo.",
            " *   Cada vez que se cambia la tarea, el pomodoro comienza de cero. S칩lo se puede cambiar",
            " *   la tarea si el pomodoro se detiene completamente (en caso contrario no ser치 editable).",
            " *   El pomodoro no puede iniciarse si no se ha definido una tarea.",
            " * - Deber치 implementar botones para iniciar el pomodoro, pausarlo, pararlo y pasar",
            " *   al siguiente ciclo del pomodoro.",
            " * - El pomodoro medir치 intervalos formados por 4 bloques de trabajo de 25 minutos con 5 minutos",
            " *   de descanso entre ellos. Cada tres bloques de descanso de 5 minutos, el cuarto bloque ser치",
            " *   de 15 minutos o 30 minutos (tambi칠n configurable y guardando la selecci칩n",
            " *   de forma persistente).",
            " * - Si la aplicaci칩n est치 en segundo plano deber치 seguir funcionando. O por lo menos seguir",
            " *   teniendo en cuenta el estado actual del pomodoro.",
            " * - Cada vez que acaba un bloque (de trabajo o de descanso) se notificar치 al usuario con",
            " *   una alerta (si est치 en primer plano e incluso con sonido) o con una notificaci칩n",
            " *   (si est치 en segundo plano) que ha finalizado ese bloque de tiempo y ha comenzado el siguiente.",
            " * - Se guardar치 un historial agrupado por d칤a con fecha de inicio y fin del bloque/s de",
            " *   trabajo junto con el texto de la tarea realizada. Tiempo total contando descanso y trabajo.",
            " *   Se guarda cada vez que se detiente el pomodoro.",
            " *   El historial puede estar en una pantalla individual.",
            " *   Se mostar치 primero el registro m치s reciente.",
            " * - Esta es un tipo de aplicaci칩n con la que podemos practicar dise침os de UI m치s elaborados.",
            " *   Intenta hacerla bonita y con animaciones!",
            " */"
        ],
        "url": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto04.md"
    },
    {
        "title": "#5 JUEGO DE MEMORIA",
        "code": [
            "/*",
            " * Crea un \"memograma\" o \"juego de memoria\" basado en parejas de cartas.",
            " *",
            " * 쯈ui칠n no ha jugado alguna vez a las parejas de cartas? Desde bien peque침os hasta ",
            " * alguna noche de fiesta, 쯖ierto? Bien, para este reto deber치s elegir tu tem치tica",
            " * favorita y recrear el famoso juego. Sorpr칠ndenos! 游땔",
            " *",
            " * Requisitos:",
            " * - Los requisitos del juego son bastante sencillos. En primer lugar, tienes que elegir",
            " *   la tem치tica que quieras, como Pok칠mon, Star Wars o incluso Peppa Pig.",
            " * - La din치mica del juego consistir치 en presentar un tablero con una serie de cartas",
            " *   boca abajo y revelar todas las parejas antes de que se acabe el tiempo.",
            " *   El usuario tocar치 cada carta para darle la vuelta y, si dos de ellas coinciden al",
            " *   descubrirlas, se pondr치n boca arriba. En caso contrario, se volver치n a ocultar.",
            " * - El juego se gana si se descubren todas las parejas dentro del l칤mite de tiempo.",
            " */"
        ],
        "url": "https://go.rviewer.io/dev-memory-game-es",
        "solution": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto05.md"
    },
    {
        "title": "#6 CLONANDO TWITTER",
        "code": [
            "/*",
            " * Replica la UI del feed de Twitter en tu propia app.",
            " *",
            " * El objetivo desde este reto es que seas capaz de replicar la capa visual del feed",
            " * principal de Tweets en tu propia app. 쯊e animas a clonar la UI de Twitter?",
            " *",
            " * Requisitos:",
            " * - Puedes clonar la versi칩n web, iOS o Android de Twitter.",
            " * - Cuanto m치s similar al dise침o original, mejor, aunque no es necesario representar",
            " *   todas funcionalidades actuales de Twitter (en las instrucciones completas se indican",
            " *   los requisitos de forma detallada). El objetivo del reto se centra principalmente en",
            " *   tener la capacidad de saber crear UI en base a un dise침o ya existente.",
            " *",
            " * - 춰Punto extra! Si quieres desafiarte un poco m치s, intenta mejorar la aplicaci칩n de Twitter.",
            " */"
        ],
        "url": "https://go.rviewer.io/dev-twitter-mirroring-es/?utm_source=mouredev&utm_medium=github_repo&utm_campaign=twitter_mirroring_mouredev",
        "solution": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto06.md"
    },
    {
        "title": "#7 LECTOR RSS",
        "code": [
            "/*",
            " * Crea un agregador de noticias enfocado en un 칰nico nicho de mercado.",
            " *",
            " * 쮼res capaz de construir el mejor agregador de noticias de un sector?",
            " *",
            " * Requisitos:",
            " * - T칰 decides el nicho que m치s te guste. Por ejemplo tecnolog칤a, desarrollo de software,",
            " *   m칰sica, comida, deporte...",
            " * - Crear치s una pantalla principal y otras para detalles, marcadores y configuraci칩n.",
            " *",
            " * - 춰Punto extra! Aqu칤 mandas t칰. Es posible que puedas implementar funcionalidades",
            " *   exclusivas que tengan especial sentido en el nicho que hayas seleccionado..",
            " *   춰Sorpr칠ndenos!",
            " */"
        ],
        "url": "https://go.rviewer.io/dev-lector-rss-es/?utm_source=mouredev&utm_medium=github_repo&utm_campaign=rss_reader_mouredev",
        "solution": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto07.md"
    },
    {
        "title": "#8 FIREBASE CHAT",
        "code": [
            "/*",
            " * Crea una aplicaci칩n de chat usando Firebase como tu backend.",
            " *",
            " * ",
            " * Requisitos:",
            " * - La aplicaci칩n tendr치 una pantalla donde tendr치s que hacer login con tu cuenta de Google.",
            " * - Una vez realizado, acceder치s a una sala de chat donde se visualizar치n los mensajes",
            " *   de todos los usuarios y podr치s interactuar con ellos.",
            " *",
            " * - 춰Punto extra! 쮼res capaz de enviar notificaciones push a otro dispositivo",
            " *   cada vez que te escriben? 쮼 im치genes?",
            " */"
        ],
        "url": "https://go.rviewer.io/dev-firebase-chat-es/?utm_source=mouredev&utm_medium=github_repo&utm_campaign=firebase_chat_mouredev",
        "solution": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto08.md"
    },
    {
        "title": "#9 ESPECIAL \"D칈A DE LA PROGRAMACI칍N\"",
        "code": [
            "/*",
            " * Crea una aplicaci칩n que ayude a nuestra comunidad.",
            " */"
        ],
        "url": "https://go.rviewer.io/hackathon-dia-de-la-programacion/?utm_source=mouredev&utm_medium=github_repo&utm_campaign=hackathon_mouredev",
        "solution": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto09.md"
    },
    {
        "title": "#10 CONVERSOR DE UNIDADES",
        "code": [
            "/*",
            " * Crea una applicaci칩n para encontrar la equivalencia de un valor en diferentes",
            " * unidades de medida.",
            " *",
            " * 쮿as probado alguna vez crear tu propio conversor de unidades?",
            " *",
            " * Requisitos:",
            " * - Si tu applicaci칩n es capaz de transformar muchos tipos de unidades, debe poseer",
            " *   una pantalla de selecci칩n y una de detalle con el conversor.",
            " * = Si decides que tu aplicaci칩n 칰nicamente soporte una familia de unidades,",
            " *   puede estar todo en una 칰nica pantalla.",
            " *",
            " * - 춰Punto extra! 쯊e atreves a utilizar otro tipo de unidades de medici칩n menos comunes?",
            " */"
        ],
        "url": "https://go.rviewer.io/dev-unit-converter-es/?utm_source=mouredev&utm_medium=github_repo&utm_campaign=unit_converter_mouredev",
        "solution": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto10.md"
    },
    {
        "title": "#11 BUON APPETITO",
        "code": [
            "/*",
            " * Crea una aplicaci칩n que sea capaz de gestionar el pedido en nuestra pizzer칤a perfecta.",
            " *",
            " * Pero, 쯣or qu칠 es perfecta? Muy f치cil, no tienes que registrarte, una pizza puede",
            " * estar compuesta hasta por 4 tipos, podr치s eliminar ingredientes y conoceremos",
            " * \"un truco\" para no tener que pagarlas.",
            " *",
            " * Requisitos:",
            " * - Al abrir la aplicaci칩n se nos presentar치 el listado de pizzas del restaurante.",
            " * - Podr치s consultar el detalle de la pizza para editarla y acceder al carrito de la:",
            " *   compra para finalizar el pedido.:",
            " *",
            " * - 춰Punto extra! 쯊e atreves a solicitar los datos de env칤o o a a침adir alg칰n m칠todo de pago?",
            " */"
        ],
        "url": "https://go.rviewer.io/dev-buon-appetito-es/?utm_source=mouredev&utm_medium=github_repo&utm_campaign=buon_appetito_mouredev",
        "solution": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto11.md"
    },
    {
        "title": "#12 LA DEVSTORE",
        "code": [
            "/*",
            " * Crea una web o app que funcione como un sitio donde encontrar aquellos productos",
            " * que crees que todo developer deber칤a conocer.",
            " *",
            " * Requisitos:",
            " * - Deber치s crear una tienda online pero sin tienda... 쮺칩mo? Tu web o app puede",
            " *   servir para enlazar a los productos que venden tiendas online reales (Amazon, por ejemplo)",
            " *   y as칤 utilizar enlaces de referidos que te aporten ingresos.",
            " * - La tienda deber치 poseer una secci칩n de productos destacados y diferentes filtros",
            " *   para agrupar por categor칤a. Los productos son de tu total elecci칩n, y cada uno",
            " *   debe tener foto (o m치s de una) y descripci칩n (e informaci칩n extra si as칤 lo quieres).",
            " *",
            " * - 춰Punto extra! Es el 칰ltimo reto del a침o... 쯈uieres formar un equipo de hasta",
            " *   3 personas (tienen que existir commits de 3 personas) para llevar a cabo el reto?",
            " *   Este es el momento.",
            " */"
        ],
        "url": "https://github.com/mouredev/Monthly-App-Challenge-2022/blob/main/SolucionesReto12.md"
    }
]